Revit 2027 API
RebarShape.GetTerminationsData Method
 Gets the terminations (e.g. hook, crank) data.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeTerminationsData GetTerminationsData()
Public Function GetTerminationsData As RebarShapeTerminationsData
public:
RebarShapeTerminationsData^ GetTerminationsData()
member GetTerminationsData : unit -> RebarShapeTerminationsData
Return Value
RebarShapeTerminationsData
 Returns the terminations (e.g. hook, crank) data.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace